trialWicking/1D_vertical_hybrid/0/Uwetting
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Uwetting;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

// Boundary types matter: on a patch where Uwetting or UnonWetting is
// fixedValue, alphaEqn.H rebuilds the relative (counter-current) flux from
// the two boundary velocities, and correctUBc.H (Uwetting fixed, U not)
// overwrites the total flux with Uwetting + UnonWetting. Otherwise the
// relative flux on the patch is zero.
// Outlet: fixed 0, so only air leaves through the top (as Ub fixed 0 in
// impesFoam). Inlet: zeroGradient, water enters with the total flux.
boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
