trialWicking/1D_vertical_hybrid/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     | Website:  https://openfoam.org
    \  /    A nd           | Version:  7
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");

interpolationScheme cellPoint; 

setFormat csv;

surfaceFormat   vtk;

sets
(
    acrossFlow
    {
        type    lineCell;
        axis    y;
        start   ( 0.000275 0.003446 0.0001185 );
        end     ( 0.000275 0 0.0001185 );
    }
);

surfaces        ();

fields          ( alpha.wetting );

// *********************************************************************** //
